{
  "recipes": [
    {
      "id": "28940",
      "title": "Chicken Sandwich",
      "description": "Fresh tomatoes, basil, mozzarella, and juicy chicken equals summer on a bun.\n\n",
      "image": "https://i.ibb.co/99BcWLcN/sandwich.webp",
      "ingredients": [
        "2 tablespoons olive oil",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "4 ciabatta rolls",
        "1/4 cup pesto, store-bought",
        "1 ball of mozzarella, sliced",
        "2  beefsteak tomatoes, sliced",
        "20 to 24 leaf basil leaves",
        "2 tablespoons balsamic glaze"
      ],
      "instructions": "Prep the chicken:\nCut the chicken breasts in half lengthwise, creating 4 thin filets. Sandwich a piece between two pieces of parchment paper or plastic wrap. Use a meat mallet or rolling pin to beat it to an even 1/4-inch thickness. Repeat with the remaining 3 filets.\n\nMarinate the chicken:\nIn a shallow dish, whisk together the olive oil, Italian seasoning, salt, and pepper. Place the chicken in the dish and turn to coat. Cover with plastic wrap and transfer to the fridge to marinate for at least 30 minutes or up to 8 hours.\nGrill the chicken and toast the buns:\nPreheat your grill to medium-high heat and lightly oil the grates. \n\nRemove the chicken from the marinade and place it on the grill. Cook on one side for 3 minutes, then flip and cook on the other side for 3 minutes. Try not to move the chicken while it cooks except for flipping once. The chicken should be cooked through, golden with grill marks, and the internal temperature should be 165°F. Transfer the chicken to a plate and let it rest for 5 minutes.\n\nWhile the chicken is grilling, you can also toast the rolls by placing them cut-side down on the grill for 1 to 2 minutes.\nAssemble the sandwich:\nSpread a generous layer of pesto on the bottom half of each ciabatta roll (about a tablespoon per roll). Add a layer of mozzarella slices, then a layer of tomato slices. Place a piece of grilled chicken on each sandwich. Finish off the sandwich with 5 to 6 fresh basil leaves and a drizzle of balsamic glaze, if desired. Place the other half of the roll on top.\n\nThis sandwich is best if you eat it fresh off the grill. Store any leftover chicken and in an airtight container for up to 3 days. Store the tomatoes and mozzarella in a separate container.\n\nTo reheat the chicken, place it in the oven at 400°F for 10 minutes, then assemble your sandwich.\n\n"
    },
    {
      "id": "37162",
      "title": "Tiramisu Cake",
      "description": "This gorgeous two-layer cake is a tiramisu lover’s dream. The fluffy mascarpone and Marsala filling uses instant vanilla pudding to help the stacked cake stand strong. Genius!\n",
      "image": "https://i.ibb.co/1GWzZQx6/Tiramisu.webp",
      "ingredients": [
        "3 egg yolks",
        "½ cup sugar",
        "8 oz mascarpone cheese",
        "1 cup heavy cream",
        "1 cup strong espresso (cooled)",
        "2 tbsp coffee liqueur (optional)",
        "20-24 ladyfingers",
        "Unsweetened cocoa powder "
      ],
      "instructions": "1️⃣ Make the Cream – Whisk egg yolks and sugar until pale and creamy. Add mascarpone and mix until smooth. In a separate bowl, whip heavy cream to stiff peaks and gently fold it into the mascarpone mixture.\n\n2️⃣ Prepare the Coffee – Brew strong espresso and mix with coffee liqueur (if using). Let it cool.\n\n3️⃣ Layer – Quickly dip ladyfingers in the coffee and arrange them in a dish. Spread half of the mascarpone mixture on top. Repeat with another layer.\n\n4️⃣ Chill & Serve – Refrigerate for at least 4 hours (or overnight). Before serving, dust with cocoa powder."
    },
    {
      "id": "37527",
      "title": "Homemade Pizza",
      "description": "Make perfect pizza at home with this pizza recipe, including an easy pizza dough recipe.",
      "image": "https://i.ibb.co/ZpMfKNRw/pizza.webp",
      "ingredients": [
        "1/2 warm water ",
        "1 package active yeast",
        "3/4 cups flour",
        "2 tablespoons olive oil",
        "2 teaspoons salt",
        "1 teaspoon sugar",
        "Tomato sauce",
        "mozzarella cheese",
        "Italian pepperoncini, thinly sliced",
        "Sliced black olives",
        "Onions, thinly sliced raw or caramelized"
      ],
      "instructions": "Mix warm water, yeast, and sugar. Let sit until foamy. Combine with flour, salt, and olive oil to form a dough. Knead for 10 minutes, then let it rise for 1 to 1.5 hours.\n\nPreheat your oven to 475°F (245°C).\n\nRoll out the dough, then brush with olive oil and spread a layer of tomato sauce. Add your favorite toppings.\n\nBake on a pizza stone for 10-15 minutes until the crust is golden and the cheese is bubbly.\n\nFinish with fresh basil, arugula, and a drizzle of pesto. Slice and enjoy!"
    },
    {
      "id": "19196",
      "title": "Pasta Puttanesca",
      "description": "Ready in a snap. So simple and so good.",
      "image": "https://i.ibb.co/VdHLqdr/pasta-puttanesca.webp",
      "ingredients": [
        "2 tablespoons extra virgin olive oil",
        "1/2 cup finely chopped onion",
        "3 cloves garlic, finely chopped",
        "2 tablespoons tomato paste",
        "1/2 teaspoon red pepper flakes",
        "1 can crushed tomatoes",
        "2 teaspoons dried oregano",
        "2 tablespoons small capers ",
        "3/4 cup  pitted olives",
        "1 pound spaghetti, linguine, or fettuccine",
        "Salt",
        "1/4 cup chopped fresh parsley"
      ],
      "instructions": "Heat pasta water:\nBring salted water to a boil (1 tbsp salt per 2 quarts of water).\n\nCook onions, anchovies, and garlic:\nHeat olive oil in a large pan. Cook onions until soft, about 4–5 minutes. Stir in chopped anchovies and oil, then garlic, and cook for 1 more minute.\n\nMake sauce:\nStir in tomato paste, cook for 2 minutes. Add crushed tomatoes, oregano, chili flakes, olives, and capers. Simmer for 10–15 minutes.\n\nCook spaghetti:\nCook pasta in boiling salted water until al dente. Save 1/2 cup pasta water.\n\nFinish sauce:\nStir parsley into sauce. Thin with pasta water if needed.\n\nServe:\nDrain pasta, toss with olive oil to prevent sticking. Mix with sauce and serve in bowls with more sauce on top."
    },
    {
      "id": "12268",
      "title": "Ice Cream Cake",
      "description": "This easy copycat Dairy Queen ice cream cake is perfect for any celebration!",
      "instructions": "Preheat the oven to 350°F. Line a sheet tray with parchment paper and set it aside. Prepare an 8x3-inch springform pan with plastic wrap on the bottom and sides. Let the chocolate ice cream soften for 15-20 minutes, then scoop it into the pan, smoothing it with a spatula. Freeze for 30 minutes. For the Oreo crunchies, combine Oreo crumbs and melted butter, then bake on the sheet tray for 10 minutes. Let the mixture cool completely. To make the fudge, heat the cream in a pot until it bubbles, then pour over the chocolate chips. Let it sit for 1 minute, stir in butter and vanilla, and mix until smooth. Pour the fudge over the frozen ice cream layer and freeze for 10 minutes. Sprinkle the cooled Oreo crunchies over the fudge and gently press them down. Freeze for 1 hour. Let the vanilla ice cream soften for 20 minutes, scoop it onto the crunchies, and smooth the top. Freeze for at least 6 hours. To make the whipped cream frosting, whip the cream, powdered sugar, and vanilla until stiff peaks form. Chill a plate for 10 minutes, then unlock the springform pan, remove the plastic wrap, and transfer the cake to the chilled plate. Frost with most of the whipped cream, leaving 1 cup for decoration. Pipe rosettes with the remaining whipped cream and add rainbow sprinkles. Freeze the cake for 20-30 minutes before serving.",
      "ingredients": [
        " 1/2 pints chocolate ice cream",
        "1/2 pints French vanilla ice cream",
        "1 cup Oreo crumbs",
        "3 tablespoons unsalted butter, melted",
        "1/2 cup heavy whipping cream",
        "1/2 cup chocolate chips",
        "1 teaspoon vanilla extract",
        "1 cup powdered sugar",
        "1/2 teaspoon vanilla extract",
        "Rainbow dot sprinkles"
      ],
      "image": "https://i.ibb.co/zTBgkC4F/ice-cream.webp"
    },
    {
      "id": "34029",
      "title": "Chicken Confit",
      "description": "Tender, juicy, and it'll last in the fridge for up to a month.\n",
      "instructions": "Season chicken with salt and pepper, and tuck garlic, thyme, cloves, and bay leaves around it. Cover and refrigerate for 24 hours. Wipe off aromatics and dry the chicken.\n\nIn a deep pan or Dutch oven, arrange chicken in one layer and cover with 4-5 cups olive oil. Heat over medium until oil reaches 125ºF. Cover and bake at 325ºF for 1.5-2 hours until meat is tender and juices run clear. Check oil bubbling after 15 minutes.\n\nCool the chicken in the oil for 30 minutes, then transfer to a platter to cool for 1 hour. Strain the oil and discard aromatics. Store chicken fully submerged in oil in the refrigerator for up to a month.\n\nTo reheat:\n\nOven: Roast at 400°F for 25 minutes, skin-side up.\nStovetop: Cook skin-side down in a skillet for 10 minutes, then flip for 2-3 minutes.\nServe with roasted potatoes, a green salad, or your favorite vegetables.",
      "ingredients": [
        "6 skin-on, bone-in whole chicken legs ",
        "1 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "3 cloves garlic, halved",
        "4 sprigs thyme",
        "4 whole cloves",
        "3 bay leaves",
        "4 to 5 cups olive oil"
      ],
      "image": "https://i.ibb.co/k62c9460/chicken.webp"
    },
    {
      "id": "50820",
      "title": "Iced coffee",
      "description": "Smooth Iced coffee",
      "image": "https://i.ibb.co/bR5fHgMn/iced-coffe.jpg",
      "ingredients": [
        "Instant coffee",
        "Sugar",
        "Chilled water",
        "Warm water",
        "Milk",
        "Ice",
        "Coffee stirrer",
        "Glass"
      ],
      "instructions": "Add coffee granules and sugar to a tall glass, then add about 2 tablespoons of warm water and stir until dissolved.\nDilute the coffee with chilled water and stir to combine. Taste and adjust the sweetness to your liking.\n\nAdd milk of choice stir to combine and finish it off with some ice. Give it another good stir and serve with a straw or drink it straight from the cup. Enjoy!\n\n"
    },
    {
      "id": "6313",
      "title": "Bison Burger",
      "description": "American bison burger made with ground buffalo meat and seasoned with sage",
      "image": "https://i.ibb.co/JRNz7FQN/burger.webp",
      "ingredients": [
        "2 pounds ground bison",
        "2 tablespoons finely chopped  sage",
        " 1/2 teaspoons salt",
        "2 teaspoons black pepper",
        "1/2 onion, finely chopped",
        "2 tablespoons olive oil"
      ],
      "instructions": "Sauté the onions in olive oil over medium-high heat until translucent. Turn off the heat and let them cool.\n\nMix onions, sage, salt, pepper into ground bison meat:\nOnce the onions are cool enough to touch, use your (clean) hands to gently mix them with the bison burger meat, adding the sage, salt, and pepper. Do not overwork the meat, as this will make the burgers tough—just fold everything together until well-mixed.\n\nForm patties:\nForm patties with the meat, using about 1/4 to 1/3 of a pound of meat per patty. Tip: Press a slight indentation in the center of each patty to help them maintain a nice disk shape while cooking—otherwise, they might become egg-shaped as the edges contract.\n\nGrill or fry the burgers:\nGrill or fry the burgers on medium heat for about 6-7 minutes per side (adjust for thickness and heat), or until the internal temperature reaches 140°F for medium rare or 160°F for well done. If you trust the source of your ground meat (e.g., Whole Foods), you can cook the burgers rare or medium rare. Otherwise, cook them well done. Avoid pressing on the burgers during cooking, and minimize flipping.\n\nLet the burgers rest for about 5 minutes before serving."
    },
    {
      "id": "9087",
      "title": "sdasasas",
      "description": "sd",
      "image": "https://i.ibb.co/zTBgkC4F/ice-cream.webp",
      "ingredients": [
        "sdsd"
      ],
      "instructions": "sdsd"
    },
    {
      "id": "76348",
      "title": "asassd",
      "description": "asas",
      "image": "https://i.ibb.co/1GWzZQx6/Tiramisu.webp",
      "ingredients": [
        "asas"
      ],
      "instructions": "asasa"
    }
  ]
}